<!DOCTYPE html>
<html>

<head>
	<meta charset="utf-8"/>
	<link rel="stylesheet" type="text/css" href="css/basic.css"/>
	<link rel="stylesheet" type="text/css" href="css/navigation_common.css"/>
	<link rel='stylesheet' type="text/css" href='css/navigation_small.css' media="screen and (max-width: 664px)"/>
	<link rel='stylesheet' type="text/css" href='css/navigation_664px.css' media="screen and (min-width: 665px) and (max-width: 1328px)"/>
	<link rel='stylesheet' type="text/css" href='css/navigation_1328px.css' media="screen and (min-width: 1329px)"/>
	<link rel="stylesheet" type="text/css" href="css/content_common.css"/>
	<link rel='stylesheet' type="text/css" href='css/content_medium.css' media="screen and (max-width: 1328px)"/>
	<link rel='stylesheet' type="text/css" href='css/content_big.css' media="screen and (min-width: 1329px)"/>
	<title>Benedikt Schmidt</title>
</head>

<body>

<div class="navigationBackground">
</div>
<div class="navigation">
	<ul>
		<li><a href="#">Start</a></li>
		<li><a href="#person">Pers&ouml;nliches</a></li>
		<li><a href="#education">Ausbildung</a></li>
		<li><a href="#work">Berufliches</a></li>
		<li><a href="#projects">Projekte</a></li>
		<li><a href="#publications">Publikationen</a></li>
		<li><a href="#leisure">Freizeit</a></li>
		<li><a href="#contact">Kontakt</a></li>
	</ul>
</div>

<div class="left">
	<img src="pic/benedikt_schmidt.png" width="100%" class="left">
</div>

<div class="content">
	<h1>Benedikt Schmidt</h1>
	<p>Herzlich Willkommen auf meiner Homepage. In den folgenden Abs&auml;tzen finden Sie die wichtigsten Informationen &uuml;ber meine Person, Ausbildung und berufliche Laufbahn.</p>

	<a id="person" class="anchor"></a>
	<h1>Pers&ouml;nliches</h1>
	<p>Man kann Menschen mit vielen Worten beschreiben, blumige Adjetive w&auml;hlen und tiefgehende Einblicke in deren Gedanken gew&auml;hren. Meine Beschreibung f&auml;llt hingegen kurz und knapp aus: Techniker bzw. Ingenieur. Letzteres darf ich mich leider noch nicht offiziell nennen, doch trifft es meine Person recht gut. Meine Interessen liegen vor allem im Bereich der Softwareentwicklung, jedoch kann ich mich privat, und nat&uuml;rlich auch im Zuge meines Studiums, zum Beispiel f&uuml;r Themen aus dem Gebiet der Elektrotechnik begeistern. Insbesondere die Energieverteilung in elektrischen Netzen hat es mir dabei angetan. Meine wahre Leidenschaft liegt jedoch eindeutig in der Softwareentwicklung, hier strebe ich stets Perfektion an, auch wenn ich sie leider nie erreichen werde. Die Technologien dabei sind an und f&uuml;r sich irrelevant, meine Spezialit&auml;t ist aber definitiv C++. Allerdings f&uuml;hle ich mich in anderen Sprachen, vor allem objektorientieren, ebenfalls wohl. C# erachte ich zum Beispiel als sehr elegante Sprache, weshalb ich sie auch bereits f&uuml;r einige Projekte w&auml;hlte. Ebenso interessiere ich mich f&uuml;r Webtechnologie, ein Produkt dieses Interesses sehen sie vor sich.</p>
	<p>Genau genommen stellen ich dann aber doch nicht den typischen Techniker dar: Ich habe keinerlei Ber&uuml;hrungs&auml;ngste mit Menschen, ich gehe gerne auf sie zu um neue Kontakte und Bekanntschaften zu schlie&szlig;en. Nicht selten war diese Eigenschaft bereits sehr n&uuml;tzlich, insbesondere bei der Koordination von Teams an der Universit&auml;t und bei der Absprache mit anderen konnte ich mich schon des&ouml;fteren profilieren.</p>
	<p>Zuguter Letzt noch ein paar allgemeine Daten &uuml;ber mich: Ich wurde als Benedikt Schmekal am 26.09.1990 in Hall in Tirol geboren. Meine Eltern sind G&uuml;nther und Bernadette Schmidt und derzeit wohne ich in Innsbruck sowie in M&uuml;nchen, wo ich mein Studium der Elektrotechnik an der Technischen Universit&auml;t M&uuml;nchen absolviere. Ich besitze eine &ouml;sterreichische Staatsb&uuml;rgerschaft und bin ledig.</p>
	<p>Bei weiterem Interesse lade ich Sie gerne zum St&ouml;bern in meinem Lebenslauf ein, damit k&ouml;nnen Sie sich dann selber einen &Uuml;berblick verschaffen</p>

	<a id="education" class="anchor"></a>
	<h1>Ausbildung</h1>
	<p>Zurzeit studiere ich Elektro- und Informationstechnik an der Technischen Universität M&uuml;nchen (TUM), das dazugehörige Bachelorstudium schloss ich bereits im Wintersemester 2013 ab. Im Grunde genommen bin ich mit der Wahl meines Studiums ein Wiederholungst&auml;ter, da ich zuvor die H&ouml;here Technische Lehr- und Versuchsanstalt (HTL) in Innsbruck, Abteilung Elektrotechnik, absolvierte. In der Unterstufte besuchte ich das Adolf-Pichler-Platz Gymnasium in Innsbruck, konnte mich jedoch mit dem allgemeinbildenden Ansatz nicht so sehr anfreunden, weshalb ich im Anschluss für die Oberstufe an die HTL wechselte.</p>
	<p>Außerdem bin ich seit Oktober 2012 in der glücklichen Lage ein Stipendium des <a href="https://www.elitenetzwerk.bayern.de/maxweberprogramm/ueberblick/">Max-Weber-Programmes</a> zu erhalten und somit zudem Mitglied im bayrischen Elitenetzwerk sein zu dürfen.</p>
	<p>Eine weitere interessante Erfahrung in meinem Leben war ein drei-wöchiger Exkurs nach Trelleborg in Schweden als Austauschsch&uuml;ler w&auml;hrend meiner Ausbildung an der HTL. Dort bekam ich die Gelegenheit die Berufswelt in einem anderen Land kennen zu lernen, sowie nat&uuml;rlich auch das Land und die Menschen dort.
	<table>
		<tr>	<td>Oktober 2013</td>	<td>heute</td>		<td>Master Elektro- und Informationstechnik, <a href="http://www.tum.de">TUM</a></td></tr>
		<tr>	<td>Mai 2011</td>	<td>Oktober 2013</td>	<td>Bachelor Elektro- und Informationstechnik, <a href="http://www.tum.de">TUM</a></td>	<td><a href="data/bachelor_zeugnis.pdf">Zeugnis</a>, <a href="data/bachelor_leistungsnachweis.pdf">Leistungsnachweis</a></td></tr>
		<tr>	<td>2005</td>		<td>2010</td>		<td>Elektrotechnik, <a href="http://www.htlinn.ac.at">HTL Anichstraße</a></td>		<td><a href="data/maturazeugnis.pdf">Reife- und Diplomprüfungszeugnis</a></td></tr>
		<tr>	<td>2001</td>		<td>2005</td>		<td>Unterstufe Realgynmasium, <a href="http://www.brg-app.tsn.at/">Adolf-Pichler-Platz</a></td></tr>
		<tr>	<td>1997</td>		<td>2001</td>		<td>Volksschule, Angergasse</td></tr>
	</table>

	<a id="work" class="anchor"></a>
	<h1>Berufliches</h1>
	<p>Bisher konnte ich bereits in den unterschiedlichsten Branchen vielf&auml;ltige Erfahrungen sammeln. Hervorzuheben hierbei wäre meine Anstellung als Software Developer bei Datacon f&uuml;r einige Monate zwischen Grundwehrdienst und Studium. Aber auch schon w&auml;hrend meiner Schulzeit absolvierte ich einige Praktika, als Elektriker, bei &ouml;ffentlichen Verkehrsbetrieben, bei einem Energieversorger uvm. Zurzeit bin ich als Studentische Hilfskraft am Sprachenzentrum der Technischen Universit&auml;t M&uuml;nchen t&auml;tig und f&uuml;r den Moodle-Support dort zust&uuml;ndig.</p>
	<p>Wie Sie anhand der folgenden Tabelle unschwer erkennen k&ouml;nnen: Still sitzen in den Ferien ist nicht unbedingt meine St&auml;rke. Dementsprechend h&auml;ften sich &uuml;ber die Jahre vielf&auml;ltige Erfahrungen bei den unterschiedlichsten Praktika.</p>
	
	<table>
		<tr>	<td>Juli 2012</td>	<td>heute</td>		<td>Studentische Hilfskraft am <a href="http://www.sprachenzentrum.tum.de/">Sprachenzentrum der TUM</a></td></tr>
		<tr>	<td>M&auml;rz 2013</td>	<td>M&auml;rz 2013</td>	<td>Werkstudent im Zuge der Bachelorarbeit am <a href="http://www.eda.ei.tum.de">Lehrstuhl f&uuml;r Entwurfsautomatisierung der TUM</a></td></tr>
		<tr>	<td>September 2012</td>	<td>September 2012</td>	<td>Werkstudent am <a href="http://www.eda.ei.tum.de">Lehrstuhl f&uuml;r Entwurfsautomatisierung der TUM</a></td></tr>
		<tr>	<td>August 2012</td>	<td>August 2012</td>	<td>Ferialarbeiter bei <a href="http://www.tiwag.at/">TIWAG</a></td></tr>
		<tr>	<td>September 2011</td>	<td>September 2011</td>	<td>Junior Software Developer bei Datacon Technology GmbH (inzwischen <a href="http://www.besi.com/">Besi Austria GmbH</a>)</td></tr>
		<tr>	<td>J&auml;nner 2011</td> <td>April 2011</td>	<td>Junior Software Developer bei Datacon Technology GmbH (inzwischen <a href="http://www.besi.com/">Besi Austria GmbH</a>)</td> <td><a href="data/Praktikum_Bestaetigung_Datacon.pdf">Arbeitsbest&auml;tigung</a></tr>
		<tr>	<td>Juli 2010</td>	<td>J&auml;nner 2011</td> <td>Grundwehrdienst als Hochgebirsj&auml;ger beim <a href="http://www.bmlv.gv.at/">&Ouml;sterreichischen Bundesheer</a></td></tr>
		<tr>	<td>August 2009</td>	<td>September 2009</td>	<td>Ferialpraktikant bei <a href="http://www.eae.at/">EAE-St&ouml;ckl GmbH</a></td></tr>
		<tr>	<td>Juli 2008</td>	<td>Juli 2008</td>	<td>Innovationspraktikant am <a href="http://www.uibk.ac.at/fakultaeten/mip/institute/mathematik.html">Institut f&uuml;r Mathematik der Universit&auml;t Innsbruck</a></td></tr>
		<tr>	<td>August 2008</td>	<td>August 2008</td>	<td>Ferialpraktikant bei <a href="http://www.ivb.at/">IVB</a></td>	<td><a href="data/Praktikum_Bestaetigung_IVB.pdf">Arbeitsbest&auml;tigung</a></td></tr>
		<tr>	<td>August 2007</td>	<td>September 2007</td>	<td>Ferialarbeiter bei <a href="http://www.helgastolz.com/">Helga Stolz Vertriebsgmbh</a></td>	<td><a href="data/Praktikum_Bestaetigung_Helgastolz.pdf">Arbeitsbest&auml;tigung</a></td></tr>
		<tr>	<td>Juli 2007</td>	<td>August 2007</td>	<td>Ferialpraktikant bei <a href="http://www.pke.at/">PKE Electronics GmbH</a></td>	<td><a href="data/Praktikum_Bestaetigung_PKE.pdf">Arbeitsbest&auml;tigung</a></td></tr>
		<tr>	<td>August 2006</td>	<td>September 2006</td>	<td>Ferialpraktikant bei den <a href="http://www.hall.ag/stw_strom/index.php">Haller Stadtwerken</a></td>	<td><a href="data/Praktikum_Bestaetigung_Stadtwerke_Hall_in_Tirol.pdf">Arbeitsbest&auml;tigung</a></td></tr>
	</table>

	<a id="projects" class="anchor"></a>
	<h1>Projekte</h1>
	<h2>Automatisierte Verdrahtung von analogen integrierten Schaltungen</h2>
	<p>Dieses Projekt führte ich im Zuge meiner Bachelorarbeit durch. Ausgangspunkt war ein Tool, Plantage genannt, welches m&ouml;gliche Platzierung von Transistorschaltungen berechnete. Meine Aufgabe dabei war es dann dieses Tool um ein Framework zur automatisierten Verdrahtung zu erweitern, sowie eine einfache Variante einer automatisierten Verdrahtung zu implementieren. Leider kann ich den Code hierfür nicht ver&ouml;ffentlichen, da die Arbeit im Rahmen eines NDA durchgeführt wurde. Sie finden aber die interessanten Details in meiner <a href="data/bachelor_thesis.pdf">Bachelorarbeit</a>.</p>
	<p>
	<img src="pic/miller_amplifier_schematic.png" width=40%><img src="pic/miller_amplifier_layout_routed.png" width="60%">
	</p>
			
	<h2>Ultimate Bomberman</h2>
	<p>Einer meiner Kurse, der Grundkurs C++, an der Universit&auml;t beinhaltete die Programmierung eines Spiels, genauer gesagt einer Variante des bekannten Spiels Bomberman. Ziel des Kurses war eigentlich die Erlernung von C++, mein pers&ouml;liches Ziel war hingegen die Leitung und Koordination eines Teams zu erlernen. Unser Team bestand aus 5 Personen und unser Endergebnis kann sich durchaus sehen lassen. Den Code finden Sie auf <a href="https://bitbucket.org/grundkurscpp/game">bitbucket</a></p>
	
	<h2>Calculator</h2>
	<p>Ein kleines Nebenprodukt des Grundkurses C++ war ein <a href="https://bitbucket.org/grundkurscpp/calculator">Taschenrechner</a>, welcher ein paar nette Features wie zum Beispiel eine String-Eingabe besitzt.</p>
	
	<h2>RoboHockey</h2>
	<p>Aufbauend auf den Grundkurs C++ bot sich in meinem Studium die Gelegenheit den Leistungskurs C++ zu absolvieren. Wiederum lag das allgemeine Lernziel eigentlich eher bei den sprachlichen Fertigkeiten, mich reizte hingegen die M&ouml;glichkeit aus den Fehlern in der Teamkoordination vom vorigen Kurs zu lernen und meine F&auml;higkeiten hinsichtlich einer Projektleitung zu verbessern.</p>
	<p>Aufgabe in diesem Kurs war es mit einem Roboter Hockey zu spielen und ein Endturnier zu gewinnen. Den Code hierf&uuml;r kann ich leider nicht ver&ouml;ffentlichen, da eines der Teammitglieder dies nicht w&uuml;nscht. Daf&uuml; gibt es die Videos vom Turnier auf youtube zu sehen.</p>
	<div class="videoWrapper"><iframe src="//www.youtube.com/embed/2-74lNZzx8g" allowfullscreen class="video"></iframe></div>
	<div class="videoWrapper"><iframe src="//www.youtube.com/embed/fTpH9mxKjkM" allowfullscreen class="video"></iframe></div>

	<a id="publications" class="anchor"></a>
	<h1>Publikationen</h1>
	<p>Benedikt Schmidt (2013): <a href="data/bachelor_thesis.pdf">Implementation of Routing in Plantage</a></p>
	<p>Benedikt Schmidt (2012): <a href="data/stipendium_vortrag.pdf">Energiewende ja, aber nicht bei uns?</a></p>
	<p>Martin Schroll, Benedikt Schmidt (2010): <a href="data/Abschlussarbeit_HTL.pdf">Software zur Berechnung von Netzen f&uuml;r die elektrische Energieverteilung in Nieder- und Mittelspannungsbereichen</a></p>

	<a id="leisure" class="anchor"></a>
	<h1>Freizeit</h1>
	<p>In meiner Freizeit besch&auml;ftige ich mich hauptsächlich mit Sport, in allen m&ouml;glichen Facetten. Ich habe jahrelang Tennis gespielt, auch manschaftsm&auml;&szlig;ig in der Tiroler Bezirksliga 2 und 3. Ebenfalls sehr lange betrieb ich Judo, insgesamt 12 Jahre lang. Aufgrund meines Studiums kann ich derzeit leider nicht so regelm&auml;&szlig;ig meinen Hobbys nachgehen, deswegen habe ich das Tennis zurzeit auf Eis gelegt. Wenn man nicht einmal w&ouml;chentlich dazu kommt macht es leider nicht sonderlich Spa&szlig;. Ich hoffe aber stark dass ich in baldiger Zukunft wieder mit dem Tennis durchstarten kann.</p>
	<p>So als &Uuml;bergangsl&ouml;sung, ein wenig Bewegung muss bei mir einfach sein, laufe ich zurzeit, gehe im Winter Ski fahren und gehe von Zeit zu Zeit klettern. Und sonst noch einiges anderes, was mir eben gerade unterkommt und sich gut ausgeht. Dabei haben es mir insbesondere die Berge angetan, egal ob zu Fu&szlig;, mit Tourenski oder auf dem Mountainbike.</p>
	<p><img src="pic/vereinsmeisterschaft_wsv.jpg" width="50%"><img src="pic/serles_sonnenaufgang.jpg" width="50%"></p>
	<p>Was jetzt nicht gerade in die Kategorie Sport f&auml;llt ist das Motorrad fahren, dabei erkunde ich mit Vorliebe die Alpen auf meiner Kawasaki ER-5. Oder auch mal die Toskana, wenn es sich ergibt.</p>
	
	<a id="contact" class="anchor"></a>
	<h1>Kontakt</h1>
	<p id="contactData">
	Benedikt Schmidt<br>
	Mitterweg 63<br>
	A-6020 Innsbruck<br>
	benediktibk@aon.at<br></p>
</div>

</body>

</html> 
